## импортируется класс datetime из модуля datetime
from datetime import datetime
##импортируется функция sqrt из модуля math
from math import sqrt


##определения функции main с произвольным количеством именованных аргументов
def main(**kwargs):
    ##итерация по элементам словаря kwargs (items() возвращает кортежи ключ-значение)
    for key in kwargs.items():
        ## вычисляет длину вектора (гипотенузу) вектора,
        # представленного координатами (x, y) точки,
        # используя формулу длины вектора в двумерном пространстве: sqrt(x^2 + y^2),
        # где x и y - координаты точки.
        result = sqrt(key[1][0] ** 2 + key[1][1] ** 2)
        ##вывод результата
        print(result)


##проверка, что файл запущен как основная программа
if __name__ == '__main__':
    ##получение текущего времени
    start_time = datetime.now()
    ##вызов функции main с передачей набора точек
main(
    one=[10, 3],
two=[5, 4],
three=[15, 13],
four=[93, 53],
five=[133, 15]
)
##вычисление затраченного времени выполнения программы
time_costs = datetime.now() - start_time
##вывод времени выполнения программы.
print(f"Время выполнения программы - {time_costs}")
